{"questions":[{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir den Geburtsort von Frank Sinatra.","keywords":"Geburtsort, Frank Sinatra","language":"de"},{"string":"Дайте меня  рождение место из Фрэнк Синатра. ","keywords":"рождение место ,  Фрэнк Sinatra ","language":"ru"},{"string":"Dar mim a nascimento Lugar, colocar do Frank Sinatra ","keywords":"nascimento Lugar,  colocar ,  Frank Sinatra ","language":"pt"},{"string":"Give me the birth place of Frank Sinatra.","keywords":"birth place, Frank Sinatra","language":"en"},{"string":"देना मुझे  जन्म जगह का फ्रैंक सिनात्रा। ","keywords":"जन्म जगह ,  फ्रैंक सिनात्रा ","language":"hi_IN"},{"keywords":"  محل  تولد,    سیناترا  صریح","language":"fa"},{"string":"Dammi il luogo di nascita di Frank Sinatra.","keywords":"luogo di nascita, Frank Sinatra","language":"it"},{"string":"Donnez-moi le lieu de naissance de Frank Sinatra.","keywords":"lieu de naissance, Frank Sinatra","language":"fr"},{"keywords":"naștere loc ,  Sincer Sinatra ","language":"ro"},{"keywords":"nacimiento lugar ,  Franco Sinatra ","language":"es"},{"keywords":"geboorte plaats ,  openhartig Sinatra ","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?place WHERE { res:Frank_Sinatra dbo:birthPlace ?place }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Hoboken,_New_Jersey"}}]}}],"aggregation":false,"id":308},{"qald-version":"9","hybrid":false,"question":[{"string":"Zeig mir alle Bücher in Asimovs Foundation-Serie.","keywords":"Asimov, Foundation-Serie, Bücher","language":"de"},{"string":"Показать меня все книги в Азимова Фонд серии. ","keywords":"книги ,  Азимов ,  Фонд серии ","language":"ru"},{"string":"exposição mim todos livros dentro Asimov's Fundação Series. ","keywords":"livros ,  Asimov ,  Fundação Series ","language":"pt"},{"string":"Show me all books in Asimov's Foundation series.","keywords":"books, Asimov, Foundation series","language":"en"},{"string":"असिमोव की फाउंडेशन श्रृंखला की सारी पुस्तकों की सूचि दिखाएं।","keywords":"असिमोव, फाउंडेशन श्रृंखला, पुस्तकों","language":"hi_IN"},{"string":"مجموعه کتاب های آسیموف چند کتاب دارد؟","keywords":"مجموعه کتاب های، آسیموف، کتاب","language":"fa"},{"string":"Mostrami tutti i libri del Ciclo della Fondazione di Asimov","keywords":"libri, Ciclo della Fondazione, Asimov","language":"it"},{"string":"Montres-moi tous les livres du Cycle de Fondation d'Asimov.","keywords":"livres, Cycle de Fondation, Asimov","language":"fr"},{"string":"Arată-mi toate cărțile din seria Fundația de Asimov","keywords":"cărți, seria Fundația, Asimov","language":"ro"},{"string":"Muéstrame todos los libros en la serie Fundación de Asimov","keywords":"libros, serie Fundación Asimov","language":"es"},{"string":"Toon alle boeken die bij de Foundation-serie horen.","keywords":"boeken, Foundation-serie","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:Foundation_series }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Originist"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Foundation_and_Earth"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Forward_the_Foundation"}}]}}],"aggregation":false,"id":341},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir die Enkel von Elvis Presley.","keywords":"Elvis Presley, Enkel","language":"de"},{"string":"Дайте меня  внучата из Элвис Presley. ","keywords":"Элвис Presley ,  внучата ","language":"ru"},{"string":"Dar mim a netos do Elvis Presley ","keywords":"Elvis Presley ,  netos ","language":"pt"},{"string":"Give me the grandchildren of Elvis Presley.","keywords":"Elvis Presley, grandchildren","language":"en"},{"string":"मुझे एल्विस प्रेस्ली के पोतों के नाम दे। ","keywords":"एल्विस प्रेस्ली, पोतो के नाम","language":"hi_IN"},{"string":"نوه های الویس پرسلی را لیست کن.","keywords":"نوه های، الویس پرسلی","language":"fa"},{"string":"Dammi i nipoti di Elvis Presley.","keywords":"Elvis Presley, nipoti","language":"it"},{"string":"Donne-moi tous les petit-enfants de Elvis Presley.","keywords":"petit-enfants, Elvis Presley","language":"fr"},{"string":"Dă-mi nepoții lui Elvis Presley.","keywords":"Elvis Presley, nepoți","language":"ro"},{"string":"Dame todos los nietos de Elvis Presley.","keywords":"Elvis Presley, nietos","language":"es"},{"string":"Toon alle kleinkinderen van Elvis Presley.","keywords":"Elvis Presley, kleinkinderen","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { res:Elvis_Presley dbo:child ?child . ?child dbo:child ?uri }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Riley_Keough"}}]}}],"aggregation":false,"id":361},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Bücher von William Goldman mit mehr als 300 Seiten.","keywords":"Buch, William Goldman, Seiten, mehr als 300","language":"de"},{"string":"Дайте меня все книги от Уильям Goldman с Больше чем 300 страницы. ","keywords":"книга ,  Уильям Goldman ,  страницы ,  Больше чем 300 ","language":"ru"},{"string":"Dar mim todos livros de William Goldman com Mais do que 300 Páginas. ","keywords":"livro ,  William Goldman ,  Páginas ,  Mais do que 300 ","language":"pt"},{"string":"Give me all books by William Goldman with more than 300 pages.","keywords":"book, William Goldman, pages, more than 300","language":"en"},{"string":"मुझे ३०० से अधिक पृष्ठों के साथ विलियम गोल्डमैन की किताबें की सूचि बतायें।","keywords":"३०० से अधिक पृष्ठों, विलियम गोल्डमैन, किताबें","language":"hi_IN"},{"string":"  صفحات  300  از  بیشتر  با  گلدمن  ویلیام  توسط  کتاب ها  همه  من  دادن","keywords":"  کتاب,    گلدمن  ویلیام,    صفحات,    300  از  بیشتر","language":"fa"},{"string":"Dammi tutti i libri di Wiliam Goldman con più di 300 pagine.","keywords":"libro, Wiliam Goldman, pagine, più di 300","language":"it"},{"string":"Donnes-moi tous les livres de William Goldman avec plus de 300 pages.","keywords":"livres, William Goldman, plus de 300 pages","language":"fr"},{"string":"Dă-mi toate carțile de William Glodman cu mai mult de 300 de pagini.","keywords":"carte, William Goldman, pagini, mai mult de 300","language":"ro"},{"string":"Dame todos los libros de Wiliam Goldman con más de 300 páginas.","keywords":"libro, William Goldman, más de 300 páginas","language":"es"},{"string":"Geef alle boeken van William Goldman met meer dan 300 pagina's.","keywords":"boeken, William Goldman, meer dan 300 pagina's","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Marathon_Man_(novel)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Which_Lie_Did_I_Tell%3F"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Hype_and_Glory"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Boys_and_Girls_Together"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tinsel_(novel)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Control_(novel)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Color_of_Light"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Princess_Bride"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Wait_Till_Next_Year"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Brothers_(Goldman_novel)"}}]}}],"aggregation":false,"id":365},{"qald-version":"9","hybrid":false,"question":[{"string":"Zeig mir das Buch, das Muhammad Ali geschrieben hat.","keywords":"Buch, geschrieben, Muhammad Ali","language":"de"},{"string":"Показать меня  книга что Мухаммед или написал. ","keywords":"книга ,  писал ,  Мухаммед или ","language":"ru"},{"string":"exposição mim a livro aquele Maomé Mas escrevi. ","keywords":"livro ,  escrevi ,  Maomé Mas ","language":"pt"},{"string":"Show me the book that Muhammad Ali wrote.","keywords":"book, wrote, Muhammad Ali","language":"en"},{"string":"मुझे किताब बताओ जो मुहम्मद अली ने लिखी थी।","keywords":"किताब, मुहम्मद अली, लिखी","language":"hi_IN"},{"string":"  نوشت.  اما  محمد  آن  کتاب  این  من  نمایش","keywords":"  کتاب,    نوشت,    اما  محمد","language":"fa"},{"string":"Mostrami il libro scritto da Muhammad Ali.","keywords":"libro, autore, Muhammad Ali","language":"it"},{"string":"Donne-moi le livre écrit par Muhammad Ali.","keywords":"livre, par Muhammad Ali","language":"fr"},{"string":"Arată-mi cartea pe care a scris-o Muhammad Ali.","keywords":"carte, scris, Muhammad Ali","language":"ro"},{"string":"Muéstrame el libro escrito por Muhammad Ali.","keywords":"libro, autor, Muhammad Ali","language":"es"},{"string":"Toen het boek dat Muhammad Ali heeft geschreven.","keywords":"boek, geschreven, Muhammad Ali","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:Muhammad_Ali }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Greatest:_My_Own_Story"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Soul_of_a_Butterfly"}}]}}],"aggregation":false,"id":377},{"qald-version":"9","hybrid":false,"question":[{"string":"Zeig mir Hemmingways Autobiographie.","keywords":"Hemmingway, Autobiographie","language":"de"},{"string":"Показать меня Хемингуэя автобиография. ","keywords":"автобиография ,  Хемингуэй ","language":"ru"},{"string":"exposição mim De Hemingway autobiografia. ","keywords":"autobiografia ,  Hemingway ","language":"pt"},{"string":"Show me Hemingway's autobiography.","keywords":"autobiography, Hemingway","language":"en"},{"string":"हेमिंग्वे की आत्मकथा मुझे दिखायें।","keywords":"हेमिंग्वे, आत्मकथा","language":"hi_IN"},{"string":"خود زندگی نامه همینگوی را بده.","keywords":"خود زندگی نامه، همینگوی","language":"fa"},{"string":"Mostrami l'autobiografia di Hemingway.","keywords":"autobiorafia, Hemingway","language":"it"},{"string":"Montre l'autobiographie de Hemingway.","keywords":"autobiographie, Hemingway","language":"fr"},{"string":"Arată-mi autobiografia lui Hemingway","keywords":"autobiografie, Hemingway","language":"ro"},{"string":"Muéstrame la autobiografía Hemingway.","keywords":"autobiografía Hemingway","language":"es"},{"string":"Toen de autobiografie van Hemmingway.","keywords":"Hemmingway, autobiografie","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { ?uri dbo:author res:Ernest_Hemingway ; dbo:literaryGenre res:Autobiography }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/A_Moveable_Feast"}}]}}],"aggregation":false,"id":385},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle kanadischen Grunge-Plattenfirmen.","keywords":"kanadisch, Plattenfirma, Grunge","language":"de"},{"string":"Дайте меня все канадец Grunge запись этикетки. ","keywords":"запись метка ,  канадец ,  Grunge ","language":"ru"},{"string":"Dar mim todos canadense Grunge registro rótulos. ","keywords":"registro rótulo ,  canadense ,  Grunge ","language":"pt"},{"string":"Give me all Canadian Grunge record labels.","keywords":"record label, Canadian, Grunge","language":"en"},{"string":"मुझे सभी कैनेडियन ग्रांज रिकॉर्ड लेबल की सूचि दें।","keywords":"कैनेडियन, ग्रांज, रिकॉर्ड लेबल","language":"hi_IN"},{"string":"  برچسب ها.  رکورد  گرانج  کانادایی  همه  من  دادن","keywords":"  برچسب  رکورد,    کانادایی,    گرانج","language":"fa"},{"string":"Dammi tutti i produttori canadesi di musica Grunge.","keywords":"produttore di musica, canadese, Grunge","language":"it"},{"string":"Donnes-moi tous les labels discographiques canadiens de grunge.","keywords":"labels discographiques, canadiens, grunge","language":"fr"},{"string":"Da pe mine toate canadian Grunge record etichete. ","keywords":"record eticheta ,  canadian ,  Grunge ","language":"ro"},{"string":"Dame todos las empresas canadienses productoras de música Grunge.","keywords":"empresa productora de música, canadiense, Grunge","language":"es"},{"string":"Noem alle Canadese grunge-platenlabels.","keywords":"Canadees, platenlabel, Grunge","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:RecordLabel ; dbo:genre res:Grunge ; dbo:country res:Canada }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Murderecords"}}]}}],"aggregation":false,"id":388},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle in Schweden geborenen Ozeanographen.","keywords":"Schweden, geborene, Ozeanographen","language":"de"},{"string":"Дайте меня все шведский океанографы. ","keywords":"шведский ,  океанограф ","language":"ru"},{"string":"Dar mim todos sueco oceanógrafos. ","keywords":"sueco ,  oceanógrafo ","language":"pt"},{"string":"Give me all Swedish oceanographers.","keywords":"Swedish, oceanographer","language":"en"},{"string":"मुझे सभी स्वीडिश महासागरीय वैज्ञानिकों की सूचि बतायें।","keywords":"स्वीडिश, महासागरीय वैज्ञानिक","language":"hi_IN"},{"string":"  اقیانوس شناسان  سوئدی  همه  من  دادن","keywords":"  سوئدی,    اقیانوس شناس","language":"fa"},{"string":"Dammi tutti gli oceanografi svedesi.","keywords":"svedesi, oceanografi","language":"it"},{"string":"Donne-moi tous les océanographes suédois.","keywords":"Océanographes, suédois","language":"fr"},{"string":"Dă-mi toți oceanografii suedezi.","keywords":"oceanograf, suedez","language":"ro"},{"string":"Dame todos los oceanógrafos suecos.","keywords":"oceanógrafos suecos","language":"es"},{"string":"Toon alle Zweedse oceanograafen.","keywords":"Zweedse, oceanograafen","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { ?uri dbo:field res:Oceanography ; dbo:birthPlace res:Sweden }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Vagn_Walfrid_Ekman"}}]}}],"aggregation":false,"id":397},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.","keywords":"Schauspieler, mitspielen, Last Action Hero","language":"de"},{"string":"Дайте меня все актеры в главной роли в Последний действие Hero. ","keywords":"актер ,  в главной роли ,  Последний действие герой ","language":"ru"},{"string":"Dar mim todos atores estrelando dentro Último Açao Herói. ","keywords":"ator ,  estrelando ,  Último Açao Herói ","language":"pt"},{"string":"Give me all actors starring in Last Action Hero.","keywords":"actor, starring, Last Action Hero","language":"en"},{"string":"मुझे लास्ट एक्शन हीरो में अभिनीत सभी कलाकारों के नाम बतायें दो।","keywords":"लास्ट एक्शन हीरो, सभी कलाकार, नाम","language":"hi_IN"},{"string":"  قهرمان  عمل  آخر  که در  بازیگران  بازیگران  همه  من  دادن","keywords":"  بازیگر,    بازیگران,    قهرمان  عمل  آخر","language":"fa"},{"string":"Dammi tutti gli attori che hanno recitato in Last Action Hero.","keywords":"attori, Last Action Hero","language":"it"},{"string":"Noem alle acteurs uit de film Last Action Hero.","keywords":"acteurs, Last Action Hero","language":"fr"},{"string":"Dă-mi toți actorii cu roluri principale în Last Action Hero.","keywords":"actor, rol principal, Last Action Hero","language":"ro"},{"string":"Dame todos los actores que hayan actuado en Last Action Hero.","keywords":"actores, Last Action Hero","language":"es"},{"string":"Noem alle acteurs uit de film Last Action Hero.","keywords":"acteur, Last Action Hero","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tom_Noonan"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/F._Murray_Abraham"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Arnold_Schwarzenegger"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Mercedes_Ruehl"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Charles_Dance"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Art_Carney"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Frank_McRae"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Austin_O'Brien"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Robert_Prosky"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Anthony_Quinn"}}]}}],"aggregation":false,"id":406},{"qald-version":"8","hybrid":false,"question":[{"string":"Give me all gangsters from the prohibition era.","keywords":"gangsters, prohibition era","language":"en"},{"language":"fa"},{"string":"Gib mir alle Gangster der Prohibitions Ära.","keywords":"Gangster, Prohibitions Ära","language":"de"},{"language":"es"},{"string":"Dammi tutti i gangster dell'era del proibizionismo.","keywords":"gangster, era, proibizionismo","language":"it"},{"string":"Donnez-moi le nom de tous les gangsters de la Prohibition.","keywords":"gangsters, Prohibition","language":"fr"},{"language":"nl"},{"language":"ro"}],"answertype":"resource","onlydbo":false,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX dbc: <http:\/\/dbpedia.org\/resource\/Category:> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation dbr:Gangster ; dct:subject dbc:Prohibition-era_gangsters }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Gus_Winkler"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Louis_Buchalter"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dean_O'Banion"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Salvatore_D'Aquila"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Mike_Genna"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Joe_Masseria"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Ciro_Terranova"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Vito_Bonventre"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Bugsy_Siegel"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Roger_Touhy"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Al_Capone"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/William_Egan_(gangster)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Bugs_Moran"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Louis_Campagna"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Owney_Madden"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Lucky_Luciano"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Nicolo_Schiro"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Fred_Burke"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Leo_Vincent_Brothers"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Salvatore_Maranzano"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/John_%22Pudgy%22_Dunn"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Ignazio_Lupo"}}]}}],"aggregation":false,"id":419},{"qald-version":"8","hybrid":false,"question":[{"string":"Give me all Seven Wonders of the Ancient World.","keywords":"Seven Wonders of the Ancient World","language":"en"},{"language":"fa"},{"string":"Gib mir alle Sieben Wunder der Antiken Welt.","keywords":"Sieben Wunder der Antiken Welt","language":"de"},{"language":"es"},{"string":"Dammi tutte le Sette Meraviglie del Mondo Antico.","keywords":"Sette Meraviglie del Mondo Antico","language":"it"},{"string":"Donnez-moi le nom des Sept Merveilles du Monde antique.","keywords":"Sept Merveilles du Monde antique","language":"fr"},{"language":"nl"},{"language":"ro"}],"answertype":"resource","onlydbo":false,"query":{"sparql":"PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX dbc: <http:\/\/dbpedia.org\/resource\/Category:> SELECT ?uri WHERE { ?uri dct:subject dbc:Seven_Wonders_of_the_Ancient_World }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Lighthouse_of_Alexandria"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Hanging_Gardens_of_Babylon"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Temple_of_Artemis"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Mausoleum_at_Halicarnassus"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Statue_of_Zeus_at_Olympia"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Seven_Wonders_of_the_Ancient_World"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Colossus_of_Rhodes"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Great_Pyramid_of_Giza"}}]}}],"aggregation":false,"id":420},{"qald-version":"7","hybrid":false,"question":[{"string":"Give me all professional skateboarders from Sweden.","keywords":"professional, skateboarder, Sweden","language":"en"},{"string":"Liste todos os skatistas profissionais da Suécia.","keywords":"skatista, profissionais, Suécia","language":"pt_BR"},{"string":"Gib mir alle Profiskateboarder aus Schweden.","keywords":"Profiskateboarder, Schweden","language":"de"},{"string":"Dame todos las skateboarders profesionales de Suecia.","keywords":"skateboarder profesional, Suecia","language":"es"},{"string":"Dammi tutti gli skateboarders professionisti di Svezia.","keywords":"skateboarders professionisti, Svezia","language":"it"},{"string":"Donne-moi tous les skateboarders professionnels de Suède.","keywords":"skateboarders professionnels, Suède","language":"fr"},{"string":"Noem alle professionele skateboarders uit Zweden.","keywords":"skateboarder, professioneel, Zweden","language":"nl"},{"string":"मुझे स्वीडन से सभी पेशेवर स्केटबोर्डर की सूचि दो।","keywords":"स्वीडन, पेशेवर स्केटबोर्डर, सूचि","language":"hi_IN"}],"answertype":"resource","onlydbo":false,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/>\nPREFIX dbp: <http:\/\/dbpedia.org\/property\/>\nPREFIX res: <http:\/\/dbpedia.org\/resource\/>\nSELECT DISTINCT ?uri \nWHERE {\n\t?uri dbo:occupation res:Skateboarding . \n        { ?uri dbo:birthPlace res:Sweden . }\n        UNION\n        { ?uri dbo:birthPlace ?place . \n          ?place dbo:country res:Sweden . }\n}"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Ali_Boulala"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tony_Magnusson"}}]}}],"aggregation":false,"id":440}]}