{"questions":[{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Filme mit Tom Cruise.","keywords":"Film, Tom Cruise","language":"de"},{"string":"Дайте меня все кино с Том Круиз. ","keywords":"кино ,  Том Круиз ","language":"ru"},{"string":"Dar mim todos filmes com Tom Cruzeiro. ","keywords":"filme ,  Tom Cruzeiro ","language":"pt"},{"string":"Give me all movies with Tom Cruise.","keywords":"movie, Tom Cruise","language":"en"},{"string":"देना मुझे सब चलचित्र साथ में टॉम क्रूज। ","keywords":"चलचित्र ,  टॉम क्रूज ","language":"hi_IN"},{"string":"تمام فیلم های تام کروز را لیست کن.","keywords":"فیلم های، تام کروز","language":"fa"},{"string":"Dammi tutti i film con Tom Cruise.","keywords":"film, Tom Cruise","language":"it"},{"string":"Donnes-moi tous les films avec Tom Cruise.","keywords":"films, Tom Cruise","language":"fr"},{"string":"Dă-mi toate filmele cu Tom Cruise.","keywords":"film, Tom Cruise","language":"ro"},{"string":"Dame todas las películas con Tom Cruise","keywords":"películas, Tom Cruise","language":"es"},{"string":"Noem alle films met Tom Cruise.","keywords":"film, Tom Cruise","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri a <http:\/\/dbpedia.org\/ontology\/Film> ; <http:\/\/dbpedia.org\/ontology\/starring> <http:\/\/dbpedia.org\/resource\/Tom_Cruise> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/All_the_Right_Moves_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Collateral_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Interview_with_the_Vampire_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Outsiders_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Far_and_Away"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Last_Samurai"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Top_Gun"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Risky_Business"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/A_Few_Good_Men"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Color_of_Money"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Mummy_(2017_film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Jerry_Maguire"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Legend_(1985_film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Vanilla_Sky"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Valkyrie_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Knight_and_Day"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Lions_for_Lambs"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Mission:_Impossible_(film_series)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Cocktail_(1988_film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Mission:_Impossible_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Born_on_the_Fourth_of_July_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Magnolia_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Firm_(1993_film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Minority_Report_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Rain_Man"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Losin'_It"}}]}}],"aggregation":false,"id":171},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.","keywords":"New Jersey, Stadt, Einwohner, mehr als 100000","language":"de"},{"string":"Дайте меня все города в новый Джерси с Больше чем 100000 жители. ","keywords":"новый Джерси ,  город ,  жителей ,  Больше чем 100000 ","language":"ru"},{"string":"Dar mim todos cidades dentro Novo Jersey com Mais do que 100000 habitantes. ","keywords":"Novo Jersey ,  cidade ,  habitantes ,  Mais do que 100000 ","language":"pt"},{"string":"Give me all cities in New Jersey with more than 100000 inhabitants.","keywords":"New Jersey, city, inhabitants, more than 100000","language":"en"},{"string":"मुझे न्यू जर्सी के १००००० से अधिक निवासियों के साथ सभी शहरों की सूचि बतायें।","keywords":"न्यू जर्सी, १००००० से अधिक निवासि, शहर","language":"hi_IN"},{"string":"  لیست تمام شهرهای نیو جرسی که جمعیت آنها بیش از ۱۰۰هزار نفر است.","keywords":"نیوجرسی، شهر، جمعیت، بیشتر از ۱۰۰۰۰۰","language":"fa"},{"string":"Dammi tutte le città del New Jersey con più di 100000 abitanti.","keywords":"New Jersey, città, abitanti, più di 100000","language":"it"},{"string":"Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.","keywords":"New Jersey, villes, habitants, plus de 100000","language":"fr"},{"string":"Da pe mine toate orase în Nou jerseu cu Mai Mult decât 100000 locuitori. ","keywords":"Nou jerseu ,  oraș ,  locuitori ,  Mai Mult decât 100000 ","language":"ro"},{"string":"Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.","keywords":"New Jersey, ciudad, habitantes, más de 100000","language":"es"},{"string":"Geef alle steden in New Jersey met meer dan 100000 inwoners.","keywords":"New Jersey, stad, inwoners, meer dan 100000","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Newark,_New_Jersey"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Jersey_City,_New_Jersey"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Elizabeth,_New_Jersey"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Paterson,_New_Jersey"}}]}}],"aggregation":false,"id":173},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir eine Liste aller Könige von Rom.","keywords":"Könige, Rom","language":"de"},{"string":"Список  семь короли из Рим. ","keywords":"короли ,  Рим ","language":"ru"},{"string":"Lista a Sete reis do Roma. ","keywords":"reis ,  Roma ","language":"pt"},{"string":"List the seven kings of Rome.","keywords":"kings, Rome","language":"en"},{"string":"सूची  सात राजाओं का रोम। ","keywords":"राजाओं ,  रोम ","language":"hi_IN"},{"string":"هفت پادشاه رم را لیست کن.","keywords":"پادشاه، رم","language":"fa"},{"string":"Elenca i sette re di Roma.","keywords":"sette re, Roma","language":"it"},{"string":"Donne-moi les sept rois de Rome.","keywords":"rois, Rome","language":"fr"},{"string":"Enumeră cei șapte regi ai Romei.","keywords":"șapte regi, Roma","language":"ro"},{"string":"Lista los siete reyes de Roma.","keywords":"siete reyes Roma","language":"es"},{"string":"Geef de seven koningen van Rome.","keywords":"koningen, Rome","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri <http:\/\/dbpedia.org\/property\/title> <http:\/\/dbpedia.org\/resource\/King_of_Rome> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tullus_Hostilius"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Lucius_Tarquinius_Superbus"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Servius_Tullius"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Ancus_Marcius"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Romulus_and_Remus"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Numa_Pompilius"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Lucius_Tarquinius_Priscus"}}]}}],"aggregation":false,"id":178},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Schäferhundrassen.","keywords":"Schäferhundrasse","language":"de"},{"string":"Дайте меня все породы из  Немецкий Пасти собака. ","keywords":"разводить ,  Немецкий Пасти собака ","language":"ru"},{"string":"Dar mim todos raças do a alemão pastor cachorro. ","keywords":"procriar ,  alemão pastor cachorro ","language":"pt"},{"string":"Give me all breeds of the German Shepherd dog.","keywords":"breed, German Shepherd dog","language":"en"},{"string":"देना मुझे सब नस्लों का  जर्मन चरवाहा कुत्ता। ","keywords":"नस्ल ,  जर्मन चरवाहा कुत्ता ","language":"hi_IN"},{"string":"تمام گونه های سگ ژرمن شپرد را لیست کن.","keywords":"گونه، سگ ژرمن شپرد","language":"fa"},{"string":"Dammi tutte le razze del pastore tedesco.","keywords":"razza, pastore tedesco","language":"it"},{"string":"Donnes-moi toutes les races de bergers allemands.","keywords":"races, bergers allemands","language":"fr"},{"string":"Dă-mi toate rasele câinelui Ciobănesc German.","keywords":"rasă, câine Ciobănesc German","language":"ro"},{"string":"Dame todas las razas de pastor alemán.","keywords":"razas de pastor alemán","language":"es"},{"string":"Noem alle soorten Duitse herders.","keywords":"Duitse herder, soort","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri <http:\/\/dbpedia.org\/property\/breed> <http:\/\/dbpedia.org\/resource\/German_Shepherd> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Mancs_(dog)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Appollo_(dog)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Blondi"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Lucca_(dog)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Lightning_(dog)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Antis_(dog)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Strongheart"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Nemo_A534"}}]}}],"aggregation":false,"id":185},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Filme, bei denen Francis Ford Coppola Regie geführt hat.","keywords":"Film, Regie, Francis Ford Coppola","language":"de"},{"string":"Дайте меня все кино направленный от Фрэнсис брод Коппола. ","keywords":"кино ,  непосредственный ,  Фрэнсис брод Коппола ","language":"ru"},{"string":"Dar mim todos filmes dirigido de Francis Ford Coppola ","keywords":"filme ,  direto ,  Francis Ford Coppola ","language":"pt"},{"string":"Give me all movies directed by Francis Ford Coppola.","keywords":"movie, direct, Francis Ford Coppola","language":"en"},{"string":"मुझे फ्रांसिस फोर्ड कोपोला द्वारा निर्देशित सभी फिल्मों की सूचि दे ।","keywords":"फ्रांसिस फोर्ड कोपोला, निर्देशित, फिल्मों","language":"hi_IN"},{"string":"تمام فیلم های کارگردانی شده توسط فرانسیس فورد کوپولا را لیست کن.","keywords":"فیلم، کارگردانی، فرانسیس فورد کوپولا","language":"fa"},{"string":"Dammi tutti i film diretti da Francis Ford Coppola.","keywords":"film, dirigere, Francis Ford Coppola","language":"it"},{"string":"Donnes-moi tous les films dont Francis réalisés par Francis Ford Coppola.","keywords":"film, directeur, Francis Ford Coppola","language":"fr"},{"string":"Dă-mi toate filmele regizate de Francis Ford Coppola.","keywords":"film, regizat, Francis Ford Coppola","language":"ro"},{"string":"Dame todas las películas que haya dirigido Francis Ford Coppola.","keywords":"película, director, Francis Ford Coppola","language":"es"},{"string":"Geef alle films die werden geregisseerd door Francis Ford Coppola.","keywords":"films, regisseur, Francis Ford Coppola","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:director res:Francis_Ford_Coppola }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Rain_People"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Godfather_Part_III"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/One_from_the_Heart"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Outsiders_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Terror_(1963_film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Godfather_Part_II"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Twixt_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Cotton_Club_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tonight_for_Sure"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Peggy_Sue_Got_Married"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Bram_Stoker's_Dracula"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Conversation"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Rumble_Fish"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Apocalypse_Now_Redux"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Godfather"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Youth_Without_Youth_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Finian's_Rainbow_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dementia_13"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tucker:_The_Man_and_His_Dream"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Gardens_of_Stone"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Rainmaker_(1997_film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/You're_a_Big_Boy_Now"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tetro"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/New_York_Stories"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Godfather_Saga"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Godfather_(film_series)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Battle_Beyond_the_Sun"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Bellboy_and_the_Playgirls"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Jack_(1996_film)"}}]}}],"aggregation":false,"id":213},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle von der NASA betriebenen Startrampen.","keywords":"Startrampe, betreiben, NASA","language":"de"},{"string":"Дайте меня все запуск подушечки управляемый от NASA. ","keywords":"запуск подушечка ,  работать ,  НАСА ","language":"ru"},{"string":"Dar mim todos lançamento almofadas operado de NASA ","keywords":"lançamento almofada ,  operar ,  NASA ","language":"pt"},{"string":"Give me all launch pads operated by NASA.","keywords":"launch pad, operate, NASA","language":"en"},{"string":"मुझे नासा द्वारा संचालित सभी लॉन्च पैड की सूचि दें।","keywords":"नासा, संचालित, लॉन्च पैड","language":"hi_IN"},{"string":"نداد  نم  همه  یزادنا هار  دپ  دنک یم راک  طسوت  اسان  ","keywords":"سکوی پرتاب, اداره کردن, ناسا","language":"fa"},{"string":"Dammi tutte le rampe di lancio gestite dalla NASA.","keywords":"rampa di lancio, gestire, NASA","language":"it"},{"string":"Donnes-moi toutes les rampes de lancements des Etats-unis.","keywords":"rampes de lancements, Etats-unis","language":"fr"},{"string":"Dă-mi toate rampele de lansare operate de către NASA.","keywords":"rampă de lansare, operat, NASA","language":"ro"},{"string":"Dame todas las plataformas de lanzamiento operadas por la NASA.","keywords":"plataforma de lanzamiento, operada por la NASA","language":"es"},{"string":"Noem alle lanceerplatformen van de NASA.","keywords":"lanceerplatform, NASA","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:LaunchPad ; dbo:operator res:NASA }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Keweenaw_Rocket_Range"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Spaceport_Florida_Launch_Complex_36"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Wallops_Flight_Facility_Launch_Area_3"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Broglio_Space_Centre"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Kennedy_Space_Center_Launch_Complex_39"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"}}]}}],"aggregation":false,"id":230},{"qald-version":"9","hybrid":false,"question":[{"string":"Liste alle Musicals mit Musik von Elton John auf.","keywords":"Musicals, Musik von, Elton John","language":"de"},{"string":"List all the musicals with music by Elton John.","keywords":"musicals, music by, Elton John","language":"en"},{"string":"एल्टन जॉन द्वारा संगीत के साथ सभी संगीतों को सूचीबद्ध करें।","keywords":"एल्टन जॉन का संगीत","language":"hi_IN"},{"string":"Elenca tutti i musicals con musiche di Elton John.","keywords":"musicals, musiche, Elton John","language":"it"},{"string":"Donne-moi tous les musicals avec de la musique de de Elton John.","keywords":"musicals, musique, Elton John","language":"fr"},{"string":"Listează toate muzicalurile cu muzică de Elton John.","keywords":"muzicaluri, muzică de Elton John","language":"ro"},{"string":"Dame todos los musicales con música de Elton John.","keywords":"musicales, música, Elton John","language":"es"},{"string":"Toen een lijst van alle musicals met muziek van Elton John.","keywords":"musicals, muziek van, Elton John","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Musical ; dbo:musicBy res:Elton_John }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Lion_King_(musical)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Lion_King_Jr_(musical)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Billy_Elliot_the_Musical"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Lestat_(musical)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Aida_(musical)"}}]}}],"aggregation":false,"id":247},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir die Laufzeit von Toy Story.","keywords":"Laufzeit, Toy Story","language":"de"},{"string":"Дайте меня  время выполнения из Игрушка История. ","keywords":"время выполнения ,  Игрушка История ","language":"ru"},{"string":"Dar mim a tempo de execução do Brinquedo História. ","keywords":"tempo de execução ,  Brinquedo História ","language":"pt"},{"string":"Give me the runtime of Toy Story.","keywords":"runtime, Toy Story","language":"en"},{"string":"मुझे खिलौना कहानी के रनटाइम बताओ।","keywords":"क्रम ,  खिलौना कहानी ","language":"hi_IN"},{"language":"fa"},{"string":"Dammi la durata di Toy Story.","keywords":"durata, Toy Story","language":"it"},{"string":"Donnez-moi la durée de Toy Story.","keywords":"durée, Toy Story","language":"fr"},{"keywords":"rulare ,  Jucărie Poveste ","language":"ro"},{"keywords":"tiempo de ejecución ,  Juguete Historia ","language":"es"},{"keywords":"runtime ,  Speelgoed Verhaal ","language":"nl"}],"answertype":"number","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?runtime WHERE { res:Toy_Story dbo:runtime ?runtime }"},"answers":[{"head":{"vars":["c"]},"results":{"bindings":[{"c":{"type":"literal","value":"4860.0"}}]}}],"aggregation":false,"id":258},{"qald-version":"9","hybrid":false,"question":[{"string":"Liste die Kinder von Margaret Thatcher auf.","keywords":"Margaret Thatcher, Kind","language":"de"},{"string":"Список  дети из Маргарет Тетчер. ","keywords":"Маргарет Thatcher ,  ребенок ","language":"ru"},{"string":"Lista a crianças do Margarida Thatcher. ","keywords":"Margarida Thatcher ,  criança ","language":"pt"},{"string":"List the children of Margaret Thatcher.","keywords":"Margaret Thatcher, child","language":"en"},{"string":"मार्गरेट थैचर के बच्चों की सूची बनाएं।","keywords":"मार्गरेट थैचर, बच्चों","language":"hi_IN"},{"string":"بچه های مارگارت تاچر را لیست کن.","keywords":"مارگارت تاچر, بچه","language":"fa"},{"string":"Elenca i figli di Margaret Thatcher.","keywords":"Margaret Thatcher, figlio","language":"it"},{"string":"Donnes-moi tous les enfants de Margaret Thatcher.","keywords":"enfants, Margaret Thatcher","language":"fr"},{"string":"Listă  copii de Margaret Thatcher. ","keywords":"Margaret Thatcher ,  copil ","language":"ro"},{"string":"Dame una lista de los hijos de Margaret Thatcher.","keywords":"Margaret Thatcher, hijos","language":"es"},{"string":"Noem alle kinderen van Margaret Thatcher.","keywords":"kinderen, Margaret Thatcher","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { res:Margaret_Thatcher dbo:child ?uri }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Carol_Thatcher"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Mark_Thatcher"}}]}}],"aggregation":false,"id":271},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.","keywords":"Schauspieler, Film, Regie, William Shatner","language":"de"},{"string":"Дайте меня все актеры в главной роли в кино направленный от Уильям Шатнер. ","keywords":"актер ,  в главной роли ,  кино ,  непосредственный ,  Уильям Шатнер ","language":"ru"},{"string":"Dar mim todos atores estrelando dentro filmes dirigido de William Shatner ","keywords":"ator ,  estrelando ,  filme ,  direto ,  William Shatner ","language":"pt"},{"string":"Give me all actors starring in movies directed by William Shatner.","keywords":"actor, starring, movie, direct, William Shatner","language":"en"},{"string":"विलियम शेटनेर द्वारा निर्देशित फिल्मों में सभी कलाकारों की सूचि दे।","keywords":"विलियम शेटनेर, निर्देशित फिल्म, कलाकार","language":"hi_IN"},{"string":"تمام بازیگرانی که در فیلم های کارگردانی شده توسط ویلیام شاتنر بازی کرده اند را لیست کن.","keywords":"بازیگرانی، فیلم های، کارگردانی شده، ویلیام شاتنر، بازی کرده اند","language":"fa"},{"string":"Dammi tutti gli attori che recitano in film diretti da William Shatner.","keywords":"attore, recitare, film, diretto, William Shatner","language":"it"},{"string":"Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.","keywords":"acteur, film, réalisé, William Shatner","language":"fr"},{"string":"Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.","keywords":"actor, rol principal, film, regiza, William Shatner","language":"ro"},{"string":"Dame todos los actores de películas dirigidas por William Shatner.","keywords":"actor, película, director, William Shatner","language":"es"},{"string":"Geef alle acteurs van films waar William Shatner de regie van voerde.","keywords":"acteur, film, regisseur, William Shatner","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring ?uri }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tom_Towles"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Brenda_Bakke"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/William_Shatner"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/George_Takei"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/John_Prosky"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Duane_Whitaker"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dick_Van_Patten"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Amy_Acker"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Leonard_Nimoy"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Rickey_Medlocke"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Walter_Koenig"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/DeForest_Kelley"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dan_Martin_(actor)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Chuck_Williams_(actor)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/J.T._Colosa"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/James_Doohan"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dan_Gauthier"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Nichelle_Nichols"}}]}}],"aggregation":false,"id":281},{"qald-version":"9","hybrid":false,"question":[{"string":"Liste alle Spiele von GMT auf.","keywords":"Spiel, GMT","language":"de"},{"string":"Список все игры от ВРЕМЯ ПО ГРИНВИЧУ. ","keywords":"игра ,  время по Гринвичу ","language":"ru"},{"string":"Lista todos jogos de GMT. ","keywords":"jogos ,  GMT ","language":"pt"},{"string":"List all games by GMT.","keywords":"game, GMT","language":"en"},{"string":"जीएमटी द्वारा सभी खेलों की सूची बनाएं।","keywords":"जीएमटी, खेल","language":"hi_IN"},{"string":"تسرهف  همه  اه یزاب  طسوت  TMG  ","keywords":"یزاب  ,  TMG  ","language":"fa"},{"string":"Elenca tutti i giochi di GMT.","keywords":"gioco, GMT","language":"it"},{"string":"Donne-moi tous les jeux de GMT.","keywords":"jeux, GMT","language":"fr"},{"string":"Listă toate jocuri de GMT. ","keywords":"joc ,  GMT ","language":"ro"},{"string":"Dame todos los juegos de GMT.","keywords":"juegos, GMT","language":"es"},{"string":"Noem alle spelen van GMT.","keywords":"spel, GMT","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Washington's_War"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Fields_of_Fire_(game)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Commands_&_Colors:_Ancients"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/A_World_At_War"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Sword_of_Rome"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Twilight_Struggle"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Paths_of_Glory_(board_game)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Chandragupta_(board_game)"}}]}}],"aggregation":false,"id":285},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Videospiele von Mean Hamster Software.","keywords":"Videospiel, Mean Hamster Software","language":"de"},{"string":"Дайте меня все видео игры опубликованный от Имею в виду хомяк Программного обеспечения. ","keywords":"видео игра ,  публиковать ,  Имею в виду хомяк Программного обеспечения ","language":"ru"},{"string":"Dar mim todos vídeo jogos Publicados de Significar Hamster Programas. ","keywords":"vídeo jogos ,  publicar ,  Significar Hamster Programas ","language":"pt"},{"string":"Give me all video games published by Mean Hamster Software.","keywords":"video game, publish, Mean Hamster Software","language":"en"},{"string":"मीन हम्सटर सॉफ्टवेयर द्वारा प्रकाशित सभी वीडियो गेम की सूचि दें। '","keywords":"मीन हम्सटर सॉफ्टवेयर, प्रकाशित, वीडियो गेम","language":"hi_IN"},{"string":"نداد  نم  همه  وئدیو  اه یزاب  هدش رشتنم  طسوت  نتشاد روظنم  رتسماه  .رازفا مرن  ","keywords":"وئدیو  یزاب  ,  راشتنا  ,  نتشاد روظنم  رتسماه  رازفا مرن  ","language":"fa"},{"string":"Dammi tutti i videogiochi di Mean Hamster Software.","keywords":"videogioco, prodotto, Mean Hamster Software","language":"it"},{"string":"Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.","keywords":"jeux vidéos, publiés, Mean Hamster Software","language":"fr"},{"string":"Dă-mi toate jocurile video publicate de Mean Hamster Software","keywords":"joc video, publicat, Mean Hamster Software","language":"ro"},{"string":"Dame todos los videojuegos de Mean Hamster Software.","keywords":"videojuego, Mean Hamster Software","language":"es"},{"string":"Geef me alle videogames van Mean Hamster Software.","keywords":"videogame, Mean Hamster Software","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:VideoGame ; dbo:publisher res:Mean_Hamster_Software }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Crossbow_(video_game)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Riven"}}]}}],"aggregation":false,"id":290},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Bandmitglieder von Prodigy.","keywords":"Bandmitglied, Prodigy","language":"de"},{"string":"Дайте меня все члены из Prodigy. ","keywords":"член ,  одаренный человек ","language":"ru"},{"string":"Dar mim todos membros do Prodígio. ","keywords":"membro ,  Prodígio ","language":"pt"},{"string":"Give me all members of Prodigy.","keywords":"member, Prodigy","language":"en"},{"string":"मुझे प्रोडिजी के सभी सदस्यों की सूचि बतायें।","keywords":"प्रोडिजी, सदस्यों","language":"hi_IN"},{"string":"تمام اعضای پرادیجی را لیست کن.","keywords":"اعضا، پرادیجی","language":"fa"},{"string":"Dammi tutti i membri dei Prodigy.","keywords":"membri, Prodigy","language":"it"},{"string":"Donne-moi tous les membres de Prodigy.","keywords":"members, Prodigy","language":"fr"},{"string":"Dă-mi toții membrii Prodigy.","keywords":"membru, Prodigy","language":"ro"},{"string":"Dame todos los miembros de la banda Prodigy.","keywords":"miembros de la banda Prodigy","language":"es"},{"string":"Noem alle leden van Prodigy.","keywords":"leden, Prodigy","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { res:The_Prodigy dbo:bandMember ?uri }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Maxim_(musician)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Liam_Howlett"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Keith_Flint"}}]}}],"aggregation":false,"id":291}]}