{"questions":[{"qald-version":"9","hybrid":false,"question":[{"string":"Liste alle Brettspiele von GMT. ","keywords":"Brettspiel ,  GMT","language":"de"},{"string":"Список все настольные игры от ВРЕМЯ ПО ГРИНВИЧУ. ","keywords":"настольная игра ,  время по Гринвичу ","language":"ru"},{"string":"Lista todos jogos de tabuleiro de GMT. ","keywords":"jogo de tabuleiro ,  GMT ","language":"pt"},{"string":"List all boardgames by GMT.","keywords":"boardgame, GMT","language":"en"},{"string":"जीएमटी द्वारा सभी बोर्ड गेम सूचीबद्ध करें।","keywords":"विशेष प्रकार के बोर्ड या पट्टे के खेल जैसे शतरंज, साँप सीढ़ी आदि, जीएमटी","language":"hi_IN"},{"string":"همه بازی های تخته ای GMT را لیست کن","keywords":"  بازی تخته,    GMT","language":"fa"},{"string":"Elenco tutti giochi da tavolo di GMT. ","keywords":"gioco da tavolo ,  GMT ","language":"it"},{"string":"liste tout jeux de plateau par GMT. ","keywords":"jeu de plateau ,  GMT ","language":"fr"},{"string":"Listă toate jocuri de masă de GMT. ","keywords":"jocuri pe ,  GMT ","language":"ro"},{"string":"Lista todas juegos de mesa por GMT. ","keywords":"juego de mesa ,  GMT ","language":"es"},{"string":"Lijst alle bordspellen door GMT. ","keywords":"bordspel ,  GMT ","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Washington's_War"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Fields_of_Fire_(game)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Commands_&_Colors:_Ancients"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/A_World_At_War"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Sword_of_Rome"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Twilight_Struggle"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Paths_of_Glory_(board_game)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Chandragupta_(board_game)"}}]}}],"aggregation":false,"id":1},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Schauspieler von Filmen, in denen William Shatner sowohl Regie geführt als auch selber mitgespielt hat.","keywords":"Film, Schauspieler, Regie, mitspielen, William Shatner","language":"de"},{"string":"Дайте меня все актеры в главной роли в кино направленный от а также в главной роли Уильям Шатнер. ","keywords":"актер ,  в главной роли ,  кино ,  непосредственный ,  в главной роли ,  Уильям Шатнер ","language":"ru"},{"string":"Dar mim todos atores estrelando dentro filmes dirigido de e estrelando William Shatner ","keywords":"ator ,  estrelando ,  filme ,  direto ,  estrelando ,  William Shatner ","language":"pt"},{"string":"Give me all actors starring in movies directed by and starring William Shatner.","keywords":"actor, starring, movie, direct, starring, William Shatner","language":"en"},{"string":"विलियम शेटनर द्वारा निर्देशित और अभिनीत फिल्मों में अभिनय करने वाले सभी कलाकारों की सूची दें।","keywords":"अभिनेता ,  अभिनीत ,  चलचित्र ,  प्रत्यक्ष ,  अभिनीत ,  विलियम शैटनर ","language":"hi_IN"},{"string":" همه بازیگرانی که در فیلم هایی که ویلیام شاتنر در آن بازی و کارگردانی کرده بازی کرده اند را لیست کن  .","keywords":"  بازیگر,    بازیگران,    فیلم سینما,    کارگردان,    بازیگران,    شاتنر  ویلیام","language":"fa"},{"string":"Dammi tutti gli attori che recitano in film diretti e recitati da William Shatner.","keywords":"attore, recitare, film, diretto, recitato, William Shatner","language":"it"},{"string":"Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner et dans lesquels il aussi joué.","keywords":"acteurs, films, réalisés, William Shatner","language":"fr"},{"string":"Da pe mine toate actori încearcă în filme dirijat de și încearcă William Shatner. ","keywords":"actor ,  încearcă ,  film ,  direct ,  încearcă ,  William Shatner ","language":"ro"},{"string":"Dame todos los actores de películas dirigidas por William Shatner en las qué también haya actúado el mismo.","keywords":"película, actor, director, William Shatner","language":"es"},{"string":"Geef alle acteurs van films waar William Shatner de regie van voerde en in meespeelde.","keywords":"acteur, film, regisseur, meespelen, William Shatner","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tom_Towles"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Brenda_Bakke"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/William_Shatner"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/John_Prosky"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dan_Martin_(actor)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Duane_Whitaker"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Chuck_Williams_(actor)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dick_Van_Patten"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/J.T._Colosa"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dan_Gauthier"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Amy_Acker"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Rickey_Medlocke"}}]}}],"aggregation":false,"id":9},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir die Enkel von Bruce Lee.","keywords":"Bruce Lee, Enkel","language":"de"},{"string":"Дайте меня  внучата из Брюс Lee. ","keywords":"Брюс подветренный ,  внучата ","language":"ru"},{"string":"Dar mim a netos do Bruce Lee ","keywords":"Bruce Lee ,  netos ","language":"pt"},{"string":"Give me the grandchildren of Bruce Lee.","keywords":"Bruce Lee, grandchildren","language":"en"},{"string":"मुझे ब्रूस ली के पोते के नाम दो।","keywords":"ब्रूस ली ,  पोते ","language":"hi_IN"},{"string":"نوه های بروس لی را لیست کن.","keywords":"  بروس لی,    نوه ها","language":"fa"},{"string":"Dammi i nipoti di Bruce Lee.","keywords":"Bruce Lee, nipoti","language":"it"},{"string":"Donne-moi tous les petit-enfants de Bruce Lee.","keywords":"petit-enfants, Bruce Lee","language":"fr"},{"string":"Dă-mi nepoții lui Bruce Lee.","keywords":"Bruce Lee, nepoți","language":"ro"},{"string":"Dame todos los nietos de Bruce Lee.","keywords":"Bruce Lee, nietos","language":"es"},{"string":"Toon alle kleinkinderen van Bruce Lee.","keywords":"Bruce Lee, kleinkinderen","language":"nl"}],"answertype":"number","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http:\/\/dbpedia.org\/property\/children> ?uri }"},"answers":[{"head":{"vars":["c"]},"results":{"bindings":[{"c":{"type":"literal","value":"1"}}]}}],"aggregation":false,"id":13},{"qald-version":"9","hybrid":false,"question":[{"string":"Zeig mir eine Liste der Fußballvereine, die in der Bundesliga spielen.","keywords":"Fußballvereine, spielen, Bundesliga","language":"de"},{"string":"Показать  список из футбольный клубы что играть в  Бундеслига. ","keywords":"футбольный клубы ,  играть ,  Бундеслига ","language":"ru"},{"string":"exposição uma Lista do futebol clubes aquele Toque dentro a Bundesliga. ","keywords":"futebol clubes ,  Toque ,  Bundesliga ","language":"pt"},{"string":"Show a list of soccer clubs that play in the Bundesliga.","keywords":"soccer clubs, play, Bundesliga","language":"en"},{"string":" बुन्डेस्लिगा में खेलने वाले फुटबॉल क्लबों की एक सूची दिखाएं।","keywords":"फुटबॉल क्लब, खेल, बुन्डेस्लिगा","language":"hi_IN"},{"string":"لیستی از باشگاه های فوتبال که در بوندسلیگا بازی می کنند را نمایش بده.","keywords":"باشگاه های فوتبال، بوندسلیگا، بازی","language":"fa"},{"string":"Dammi una lista di club calcistici che giocano nella Bundesliga.","keywords":"club calcistici, Bundesliga","language":"it"},{"string":"Donne-moi la liste des clubs de football qui jouent dans la Bundesliga.","keywords":"clubs de football, Bundesliga","language":"fr"},{"string":"Arată o listă a cluburilor de fotbal care joacă în Bundesliga.","keywords":"cluburi de fotbal, joacă, Bundesliga","language":"ro"},{"string":"Dame una lista de los clubs de futbol que juegan en Bundesliga.","keywords":"clubs de futbol, Bundesliga","language":"es"},{"string":"Toen een lijst van voetbalclubs die in de Bundesliga spelen.","keywords":"voetbalclubs, spelen, Bundesliga","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri a <http:\/\/dbpedia.org\/ontology\/SoccerClub> ; <http:\/\/dbpedia.org\/ontology\/league> <http:\/\/dbpedia.org\/resource\/Bundesliga> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Borussia_Mönchengladbach"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/SV_Darmstadt_98"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/FC_Augsburg"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Bayer_04_Leverkusen"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/VfL_Wolfsburg"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/FC_Ingolstadt_04"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Eintracht_Frankfurt"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/SC_Freiburg"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Hertha_BSC"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/1._FC_Köln"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/SV_Werder_Bremen"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/1._FSV_Mainz_05"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/FC_Schalke_04"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/RB_Leipzig"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/TSG_1899_Hoffenheim"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/FC_Bayern_Munich"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Borussia_Dortmund"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Hamburger_SV"}}]}}],"aggregation":false,"id":46},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir die Haupstädte aller Länder, über die sich der Himalaya erstreckt.","keywords":"Länder, erstrecken, Himalaya, Haupstadt","language":"de"},{"string":"Дайте меня  столицы из все страны что  Гималаи бег через. ","keywords":"страны Гималаи бег через ,  столицы ","language":"ru"},{"string":"Dar mim a capitais do todos paises aquele a Himalaia corre através. ","keywords":"paises Himalaia corre através ,  capitais ","language":"pt"},{"string":"Give me the capitals of all countries that the Himalayas run through.","keywords":"countries Himalayas run through, capitals","language":"en"},{"string":"मुझे उन सभी देशों की राजधानियां दें जिनमें हिमालय हैं।","keywords":"जिन देशों में हिमालय है, राजधानियों","language":"hi_IN"},{"string":"پایتخت تمام کشورهایی که هیمالیا از آنها می گذرد را لیست کن.","keywords":"پایتخت، کشورهایی، هیمالیا، می گذرد","language":"fa"},{"string":"Dammi tutte le capitali degli stati attraversati dall'Himalaya.","keywords":"capitali, stati attraversati dall'Himalaya","language":"it"},{"string":"Donne-moi les capitales de tous les pays que l'Himalaya traverse.","keywords":"capitales, pays, traversé, Himalaya","language":"fr"},{"string":"Dă-mi toate țările traversate de Himalaya și capitalele lor.","keywords":"țări, traversate de Himalaya, capitale","language":"ro"},{"string":"Dame las capitales de todos los países que atraviesa el Himalaya.","keywords":"capital de países, atraviesa el Himalaya","language":"es"},{"string":"Toon de hoofdsteden van alle landen waardoor de Himalaya loopt.","keywords":"Himalaya, lopen door, landen, hoofdsteden","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { <http:\/\/dbpedia.org\/resource\/Himalayas> <http:\/\/dbpedia.org\/ontology\/country> ?country . ?country <http:\/\/dbpedia.org\/ontology\/capital> ?uri }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Thimphu"}}]}}],"aggregation":false,"id":55},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Vereine in der Premier League.","keywords":"Premier League, Verein","language":"de"},{"string":"Дайте меня все футбольный клубы в  премьер Лига. ","keywords":"премьер лига ,  футбольный клуб ","language":"ru"},{"string":"Dar mim todos futebol clubes dentro a Premier Liga. ","keywords":"Premier Liga ,  futebol clube ","language":"pt"},{"string":"Give me all soccer clubs in the Premier League.","keywords":"Premier League, soccer club","language":"en"},{"string":"मुझे प्रीमियर लीग के सभी सॉकर क्लब के नाम दें।","keywords":"प्रधान संघ ,  फुटबॉल क्लब ","language":"hi_IN"},{"string":"تمام باشگاه های فوتبال در لیگ برتر را لیست کن.","keywords":"باشگاه های فوتبال، لیگ برتر","language":"fa"},{"string":"Dammi tutti i club calcistici nella Premier League.","keywords":"Premier League, club calcistici","language":"it"},{"string":"Donnes-moi toutes les équipes de la Premier League.","keywords":"équipes, Premier League","language":"fr"},{"string":"Dă-mi toate cluburile de fotbal din Premier League","keywords":"Premier League, club de fotbal","language":"ro"},{"string":"Dame todos los clubs de la Premier League.","keywords":"Premier League, club","language":"es"},{"string":"Noem alle clubs uit de Premier League.","keywords":"club, Premier League","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri a <http:\/\/dbpedia.org\/ontology\/SoccerClub> ; <http:\/\/dbpedia.org\/ontology\/league> <http:\/\/dbpedia.org\/resource\/Premier_League> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2012\u201313_Arsenal_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2014\u201315_Chelsea_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2013\u201314_Chelsea_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2010\u201311_Birmingham_City_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2013\u201314_Arsenal_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2007\u201308_Wigan_Athletic_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2007\u201308_Chelsea_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2007\u201308_Manchester_City_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2008\u201309_Manchester_City_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2011\u201312_Chelsea_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2010\u201311_Arsenal_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2014\u201315_Southampton_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2015\u201316_Southampton_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2008\u201309_Arsenal_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2006\u201307_Reading_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2012\u201313_Chelsea_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2012\u201313_Reading_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2009\u201310_Arsenal_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2006\u201307_Bolton_Wanderers_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2013\u201314_Cardiff_City_F.C._season"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/2005\u201306_Wigan_Athletic_F.C._season"}}]}}],"aggregation":false,"id":64},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle ESA-Astronauten.","keywords":"ESA-Astronauten","language":"de"},{"string":"Дайте меня все ESA астронавты. ","keywords":"ESA космонавты ","language":"ru"},{"string":"Dar mim todos ESA astronautas. ","keywords":"ESA astronautas ","language":"pt"},{"string":"Give me all ESA astronauts.","keywords":"ESA astronauts","language":"en"},{"string":"देना मुझे सब ईएसए अंतरिक्ष यात्री। ","keywords":"ईएसए अंतरिक्ष यात्री ","language":"hi_IN"},{"string":"تمام فضانوردان ایی.اس.ای را لیست کن.","keywords":"فضانوردان ایی.اس.ای","language":"fa"},{"string":"Dammi tutti gli astronauti dell'ESA.","keywords":"Astronauti ESA","language":"it"},{"string":"Donne-moi tous les astronautes de l'ESA.","keywords":"austronautes, ESA","language":"fr"},{"string":"Dă-mi toți astronauții ESA.","keywords":"astronauți ESA","language":"ro"},{"string":"Dame todos los astronautas de la ESA.","keywords":"Astronautas ESA","language":"es"},{"string":"Geef alle ESA-astronauten.","keywords":"ESA-astronauten","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri a <http:\/\/dbpedia.org\/ontology\/Astronaut> ; <http:\/\/dbpedia.org\/property\/type> <http:\/\/dbpedia.org\/resource\/European_Space_Agency> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dirk_Frimout"}}]}}],"aggregation":false,"id":73},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle in Berlin geborenenen Schauspieler.","keywords":"Schauspieler, geboren, Berlin","language":"de"},{"string":"Дайте меня все актеры кто мы Родился в Берлин. ","keywords":"актеры ,  Родился ,  Берлин ","language":"ru"},{"string":"Dar mim todos atores quem estavam nascermos dentro Berlim. ","keywords":"atores ,  nascermos ,  Berlim ","language":"pt"},{"string":"Give me all actors who were born in Berlin.","keywords":"actors, born, Berlin","language":"en"},{"string":"मुझे बर्लिन में पैदा हुए सभी कलाकारों को दो।","keywords":"अभिनेताओं, जन्म, बर्लिन","language":"hi_IN"},{"string":"تمام بازیگرانی که در برلین متولد شدند را لیست کن.","keywords":"بازیگرانی، برلین، متولد","language":"fa"},{"string":"Dammi tutti gli attori nati a Berlino.","keywords":"attori, nati, Berlino","language":"it"},{"string":"Donne-moi tous les acteurs nés à Berlin.","keywords":"acteurs, lieu de naissance, Berlin","language":"fr"},{"string":"Dă-mi toți actorii care s-au născut la Berlin.","keywords":"actori, născut, Berlin","language":"ro"},{"string":"Dame todos los actores nacidos en Berlin.","keywords":"actores, nacidos, Berlin","language":"es"},{"string":"Toon alle acteurs die in Berlijn zijn geboren.","keywords":"actuers, geboren, Berlijn","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri a <http:\/\/dbpedia.org\/ontology\/Actor> ; <http:\/\/dbpedia.org\/ontology\/birthPlace> <http:\/\/dbpedia.org\/resource\/Berlin> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dru_Berrymore"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Tyra_Misoux"}}]}}],"aggregation":false,"id":86},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle Fernsehserien mit Neil Patrick Harris.","keywords":"Fernsehserien, Neil Patrick Harris","language":"de"},{"string":"Дайте меня все  ТВ шоу с Нил Патрик Харрис. ","keywords":"ТВ шоу ,  Нил Патрик Харрис ","language":"ru"},{"string":"Dar mim todos a televisão mostra com Neil Patrick Harris ","keywords":"televisão mostra ,  Neil Patrick Harris ","language":"pt"},{"string":"Give me all the TV shows with Neil Patrick Harris.","keywords":"TV shows, Neil Patrick Harris","language":"en"},{"string":" मुझे नील पैट्रिक हैरिस वाले सभी टीवी शो दें।","keywords":"टीवी शो, नील पैट्रिक हैरिस","language":"hi_IN"},{"string":"تمام نمایش های تلویزیونی با نیل پاتریک هریس را لیست کن.","keywords":"نمایش تلویزیونی، نیل پاتریک هریس","language":"fa"},{"string":"Dammi tutti i programmi televisivi con Neil Patrick Harris.","keywords":"programmi televisivi, Neil Patrick Harris","language":"it"},{"string":"Donne-moi toutes les émissions de télé avec Neil Patrick Harris.","keywords":"émissions de télé, Neil Patrick Harris","language":"fr"},{"string":"Dă-mi toate emisiunile TV cu Neil Patrick Harris","keywords":"emisiuni TV, Neil Patrick Harris","language":"ro"},{"string":"Dame todos los programas de televisión con Neil Patrick Harris.","keywords":"programas de televisión, Neil Patrick Harris","language":"es"},{"string":"Toen alle TV programma's met Neil Patrick Harris.","keywords":"TV programma's, Neil Patrick Harris","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri a <http:\/\/dbpedia.org\/ontology\/TelevisionShow> ; <http:\/\/dbpedia.org\/ontology\/starring> <http:\/\/dbpedia.org\/resource\/Neil_Patrick_Harris> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Capitol_Critters"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Doogie_Howser,_M.D."}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/A_Series_of_Unfortunate_Events_(TV_series)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Dr._Horrible's_Sing-Along_Blog"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Robot_Chicken_DC_Comics_Special"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Neil's_Puppet_Dreams"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Snowbound:_The_Jim_and_Jennifer_Stolpa_Story"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/How_I_Met_Your_Mother"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Joan_of_Arc_(miniseries)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Stark_Raving_Mad_(TV_series)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Too_Good_to_Be_True_(film)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Christmas_Blessing"}}]}}],"aggregation":false,"id":91},{"qald-version":"9","hybrid":false,"question":[{"string":"Gib mir alle schwedischen Feiertage.","keywords":"schwedische Feiertage","language":"de"},{"string":"Дайте меня все шведский каникулы. ","keywords":"шведский каникулы ","language":"ru"},{"string":"Dar mim todos sueco feriados. ","keywords":"sueco feriados ","language":"pt"},{"string":"Give me all Swedish holidays.","keywords":"Swedish holidays","language":"en"},{"string":"मुझे सभी स्वीडिश छुट्टियों की सूची दें","keywords":"स्वीडिश छुट्टियां ","language":"hi_IN"},{"string":"تمام تعطیلات سوئدی را لیست کن.","keywords":"تعطیلات سوئدی","language":"fa"},{"string":"Dammi tutti i giorni festivi svedesi.","keywords":"giorni festivi svedesi","language":"it"},{"string":"Donne-moi tous les jours fériés en Suède.","keywords":"jours fériés, Suède","language":"fr"},{"string":"Dă toate zilele de sărbătoare din Suedia.","keywords":"zile de sărbătoare, Suedia","language":"ro"},{"string":"Dame todos los días festivos en Suecia.","keywords":"días festivos, Suecia","language":"es"},{"string":"Geef alle Zweedse feestdagen.","keywords":"Zweedse feestdagen","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri a <http:\/\/dbpedia.org\/ontology\/Holiday> ; <http:\/\/dbpedia.org\/ontology\/country> <http:\/\/dbpedia.org\/resource\/Sweden> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Gustavus_Adolphus_Day"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Veterans_Day_(Sweden)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/St._Knut's_Day"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Christmas_tree_plundering"}}]}}],"aggregation":false,"id":94},{"qald-version":"9","hybrid":false,"question":[{"string":"Liste alle Musicals mit Musik von Leonard Bernstein auf.","keywords":"Musicals, Musik von, Leonard Bernstein","language":"de"},{"string":"Список все  мюзиклы с Музыка от Леонард Бернштейн. ","keywords":"мюзиклы ,  Музыка от ,  Леонард Бернштейн ","language":"ru"},{"string":"Lista todos a musicais com música de Leonard Bernstein ","keywords":"musicais ,  música de ,  Leonard Bernstein ","language":"pt"},{"string":"List all the musicals with music by Leonard Bernstein.","keywords":"musicals, music by, Leonard Bernstein","language":"en"},{"string":"लियोनार्ड बर्नस्टीन द्वारा संगीत के साथ सभी संगीत सूचीबद्ध करें।","keywords":"संगीत ,  संगीत द्वारा ,  लियोनार्ड बर्नस्टीन ","language":"hi_IN"},{"string":"تمام فیلم های موزیکال با موسیقی لئونارد برنستاین را لیست کن.","keywords":"فیلم های موزیکال، موسیقی، لئونارد برنستاین","language":"fa"},{"string":"Elenca tutti i musical con musiche di Leonard Bernstein.","keywords":"musicals, musiche, Leonard Bernstein","language":"it"},{"string":"Donne-moi tous les musicals avec de la musique de Leonard Bernstein.","keywords":"musicals, musique, Leonard Bernstein","language":"fr"},{"string":"Listează toate muzicalurile cu muzică de Leonard Bernstein.","keywords":"muzicaluri, muzică de Leonard Bernstein","language":"ro"},{"string":"Dame todos los musicales con música de Leonard Bernstein.","keywords":"musicales, música, Leonard Bernstein","language":"es"},{"string":"Toen een lijst van alle musicals met muziek van Leonard Bernstein.","keywords":"musicals, muziek van, Leonard Bernstein","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"SELECT DISTINCT ?uri WHERE { ?uri a <http:\/\/dbpedia.org\/ontology\/Musical> ; <http:\/\/dbpedia.org\/ontology\/musicBy> <http:\/\/dbpedia.org\/resource\/Leonard_Bernstein> }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Wonderful_Town"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Candide_(operetta)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Race_to_Urga"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/1600_Pennsylvania_Avenue_(musical)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/On_the_Town_(musical)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/West_Side_Story"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/A_Party_with_Betty_Comden_and_Adolph_Green"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Side_by_Side_by_Sondheim"}}]}}],"aggregation":false,"id":96},{"qald-version":"9","hybrid":false,"question":[{"string":"Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.","keywords":"HBO-Fernsehserie, Sopranos, erste Staffel, Episode","language":"de"},{"string":"Список все эпизоды из  первый время года из  ГБО телевидение серии  Сопрано! ","keywords":"ГБО ,  телевидение серии ,  Сопрано ,  первый время года ,  эпизод ","language":"ru"},{"string":"Lista todos episódios do a primeiro estação do a HBO televisão Series o Sopranos! ","keywords":"HBO ,  televisão Series ,  Sopranos ,  primeiro estação ,  episódio ","language":"pt"},{"string":"List all episodes of the first season of the HBO television series The Sopranos!","keywords":"HBO, television series, Sopranos, first season, episode","language":"en"},{"string":"एचबीओ टेलीविजन श्रृंखला द सोप्रानोस! के पहले सीज़न के सभी एपिसोड की सूची बनाएं ।","keywords":"एचबीओ, टेलीविजन श्रृंखला, द सोप्रानोस!, पहले सीज़न, सभी एपिसोड","language":"hi_IN"},{"string":"همه قسمت های فصل اول سریال سوپرانو شبکه HBO را لیست کن.","keywords":"HBO, سریال, سوپرانو, اولین فصل, قسمت","language":"fa"},{"string":"Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos!","keywords":"serie televisiva di HBO, i Sopranos, prima stagione, episodio","language":"it"},{"string":"Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.","keywords":"épisodes de la première saison, HBO, les Sopranos","language":"fr"},{"string":"Listă toate episoade de  primul sezon de  HBO televiziune serie  Sopranos! ","keywords":"HBO ,  televiziune serie ,  Sopranos ,  primul sezon ,  episod ","language":"ro"},{"string":"Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.","keywords":"serie televisiva de HBO, Los Sopranos, primera época, episodios","language":"es"},{"string":"Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.","keywords":"HBO-serie, The Sopranos, eerste seizoen, aflevering","language":"nl"}],"answertype":"resource","onlydbo":true,"query":{"sparql":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX res: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }"},"answers":[{"head":{"vars":["uri"]},"results":{"bindings":[{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Isabella_(The_Sopranos)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Meadowlands_(The_Sopranos)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/I_Dream_of_Jeannie_Cusamano"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Legend_of_Tennessee_Moltisanti"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Boca_(The_Sopranos)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Nobody_Knows_Anything"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Pax_Soprana"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/A_Hit_Is_a_Hit"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Denial,_Anger,_Acceptance"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/College_(The_Sopranos)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/46_Long"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/The_Sopranos_(episode)"}},{"uri":{"type":"uri","value":"http:\/\/dbpedia.org\/resource\/Down_Neck"}}]}}],"aggregation":false,"id":158}]}