id,question,sparql,BIND,CONSTRUCT,FILTER,MAX,LIMIT,SUM,GROUP BY,AVG,MIN,YEAR,NOW,ASK,OFFSET,COUNT,HAVING,DESCRIBE,UNION,ORDER BY
122,Do Urdu and Persian have a common root?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> ASK WHERE { dbr:Urdu dbo:languageFamily ?uri . dbr:Persian_language dbo:languageFamily ?uri },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
123,Is Lake Baikal bigger than the Great Bear Lake?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Lake_Baikal dbo:areaTotal ?a1 . res:Great_Bear_Lake dbo:areaTotal ?a2 FILTER ( ?a1 > ?a2 ) },0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
124,Which city has the oldest running metro?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?loc WHERE { ?uri dbo:type dbr:Rapid_transit ; dbo:openingYear ?date ; dbo:location ?loc . ?loc rdf:type dbo:City } ORDER BY ASC(?date) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
125,What is the bridge with the longest span?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Bridge ; dbo:mainspan ?s } ORDER BY DESC(?s) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
126,Is there a video game called Battle Chess?,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { ?uri rdf:type dbo:VideoGame ; rdfs:label ""Battle Chess""@en }",0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
127,Does the Ford Motor Company have a manufacturing plant in Malaysia?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> ASK WHERE { ?uri dbo:assembly dbr:Malaysia ; dbo:manufacturer dbr:Ford_Motor_Company },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
128,Did Socrates influence Aristotle?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aristotle dbo:influencedBy res:Socrates },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
129,How many children did Benjamin Franklin have?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Benjamin_Franklin dbo:child ?uri },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
130,Give me all books by William Goldman with more than 300 pages.,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:author res:William_Goldman ; dbo:numberOfPages ?x FILTER ( ?x > 300 ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
131,Does Abraham Lincoln's death place have a website?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Abraham_Lincoln dbo:deathPlace ?p . ?p dbo:website ?w },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
132,Did Elvis Presley have children?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Elvis_Presley dbo:child ?uri },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
133,Is Michelle Obama the wife of Barack Obama?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Barack_Obama dbo:spouse res:Michelle_Obama },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
134,How many languages are spoken in Colombia?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri rdf:type dbo:Language . res:Colombia dbo:language ?uri },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
135,What is the highest mountain in Australia?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea res:Australia ; dbo:elevation ?elevation } ORDER BY DESC(?elevation) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
136,Is Rita Wilson the wife of Tom Hanks?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Tom_Hanks dbo:spouse res:Rita_Wilson },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
137,Which of Tim Burton's films had the highest budget?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:director res:Tim_Burton ; dbo:budget ?b } ORDER BY ?b OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
138,Which museum in New York has the most visitors?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Museum ; dbo:location res:New_York_City ; dbo:numberOfVisitors ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
139,What was the first Queen album?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Album ; dbo:artist <http://dbpedia.org/resource/Queen_(band)> ; dbo:releaseDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
140,What was the last movie with Alec Guinness?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Alec_Guinness ; dbo:releaseDate ?date } ORDER BY DESC(?date) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
141,Give me a list of all critically endangered birds.,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri ?p WHERE { ?uri rdf:type dbo:Bird { ?uri dbo:conservationStatus ""CR"" } UNION { ?uri dct:subject dbc:Critically_endangered_animals } }",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
142,Which book has the most pages?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Book ; dbo:numberOfPages ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
143,Are there any castles in the United States?,PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> ASK WHERE { ?uri dct:subject dbc:Castles_in_the_United_States },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
144,Can you find frescoes in Crete?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX dbr: <http://dbpedia.org/resource/> ASK WHERE { ?uri dct:subject dbc:Minoan_frescos ; dbp:museum ?museum . ?museum dbo:location dbr:Crete },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
145,How many years was the Ford Model T manufactured?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX res: <http://dbpedia.org/resource/> SELECT (( year(xsd:date(?end)) - year(xsd:date(?start)) ) AS ?years) WHERE { res:Ford_Model_T dbo:productionEndYear ?end ; dbo:productionStartYear ?start },0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
146,How many rivers and lakes are in South Carolina?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dct: <http://purl.org/dc/terms/> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT (COUNT(DISTINCT ?uri) AS ?count) WHERE { { ?uri dbo:location dbr:South_Carolina ; rdf:type dbo:Lake } UNION { ?uri dct:subject dbc:Rivers_and_streams_of_South_Carolina } },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0
147,Is Pluto really a planet?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { dbr:Pluto rdf:type dbo:Planet },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
149,What was the name of the famous battle in 1836 in San Antonio?,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?uri WHERE { ?uri rdf:type dbo:MilitaryConflict ; dbo:place dbr:San_Antonio ; dbo:date ?date FILTER ( ?date > ""1835-12-31T00:00:00Z""^^xsd:dateTime ) FILTER ( ?date <= ""1836-12-31T00:00:00Z""^^xsd:dateTime ) }",0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
150,Give me all professional skateboarders from Sweden.,"PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri 
WHERE {
	?uri dbo:occupation res:Skateboarding . 
        { ?uri dbo:birthPlace res:Sweden . }
        UNION
        { ?uri dbo:birthPlace ?place . 
          ?place dbo:country res:Sweden . }
}",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
151,Which computer scientist won an oscar?,"SELECT DISTINCT ?uri WHERE { { ?uri <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Computer_science> . } UNION { ?uri <http://purl.org/dc/elements/1.1/description> ?s . FILTER regex(?s,'computer scientist','i') } ?uri <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Academy_Awards> . } ",0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
152,How many companies were founded in the same year as Google?,"SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company> .  ?uri <http://dbpedia.org/ontology/foundingYear> ?year .  <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/foundingYear> ?year . } ",0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
153,How many companies were founded by the founder of Facebook?,"SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Facebook> <http://dbpedia.org/ontology/foundedBy> ?uri .  ?uri <http://dbpedia.org/ontology/foundedBy> ?uri . } ",0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
154,Who is the youngest player in the Premier League?,"PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:team ?x . 
        ?x dbo:league res:Premier_League . 
        ?uri dbo:birthDate ?y . 
} 
ORDER BY DESC(?y) 
OFFSET 0 LIMIT 1",0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
