id,question,sparql,BIND,CONSTRUCT,FILTER,MAX,LIMIT,SUM,GROUP BY,AVG,MIN,YEAR,NOW,ASK,OFFSET,COUNT,HAVING,DESCRIBE,UNION,ORDER BY
1,Which countries have places with more than two caves?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?cave rdf:type dbo:Cave ; dbo:location ?uri . ?uri rdf:type dbo:Country } GROUP BY ?uri HAVING ( COUNT(?cave) > 2 ),0,0,0,0,0,0,1,0,0,0,0,0,0,1,1,0,0,0
2,Give me all actors starring in movies directed by and starring William Shatner.,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } },0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
3,Which other weapons did the designer of the Uzi develop?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Weapon ; dbp:designer ?x . res:Uzi dbp:designer ?x FILTER ( ?uri != res:Uzi ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
4,Which state of the USA has the highest population density?,PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:densityrank ?rank } ORDER BY ASC(?rank) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
5,Which monarchs were married to a German?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Monarch ; dbo:spouse ?spouse { ?spouse dbo:birthPlace res:Germany } UNION { ?spouse dbo:birthPlace ?p . ?p dbo:country res:Germany } },0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
6,Which organizations were founded in 1950?,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Organisation { ?uri dbo:formationYear ?date } UNION { ?uri dbo:foundingYear ?date } UNION { ?uri dbp:foundation ?date } UNION { ?uri dbp:formation ?date } FILTER regex(?date, ""^1950"") }",0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
7,Which state of the United States of America has the highest density?,PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri dbp:densityrank ?density } ORDER BY ASC(?density) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
8,Which U.S. states are in the same timezone as Utah?,PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Utah dbp:timezone ?x . ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:timezone ?x FILTER ( ?uri != res:Utah ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
9,Which U.S. states possess gold minerals?,"PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:mineral ?mineral FILTER regex(?mineral, ""gold"", ""i"") }",0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
10,Which caves have more than 3 entrances?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Cave> ; <http://dbpedia.org/property/entranceCount> ?entrance FILTER ( ?entrance > 3 ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
11,Who is the tallest player of the Atlanta Falcons?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Atlanta_Falcons> ; <http://dbpedia.org/ontology/height> ?h } ORDER BY DESC(?h) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
12,What are the top-10 action role-playing video games according to IGN?,SELECT DISTINCT ?uri WHERE { ?uri <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Action_role-playing_video_games> ; <http://dbpedia.org/property/ign> ?score } ORDER BY DESC(?score) LIMIT 10,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
13,Show me all basketball players that are higher than 2 meters.,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
16,Which presidents were born in 1945?,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/President> ; <http://dbpedia.org/ontology/birthDate> ?date FILTER regex(?date, ""^1945"") }",0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
17,Which volcanos in Japan erupted since 2000?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Volcano> ; <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Japan> ; <http://dbpedia.org/ontology/eruptionYear> ?date FILTER ( year(?date) >= 2000 ) },0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
18,How many films did Hal Roach produce?,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
19,What is the most frequent cause of death?,SELECT DISTINCT ?x WHERE { ?uri <http://dbpedia.org/ontology/deathCause> ?x . } ORDER BY DESC(COUNT(DISTINCT ?uri)) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,0,0,1
20,Who are the four youngest MVP basketball players?,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/birthDate> ?date ; <http://dbpedia.org/property/highlights> ?h FILTER regex(?h, ""MVP"") } ORDER BY DESC(?date) OFFSET 0 LIMIT 4",0,0,1,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
22,How many movies did Park Chan-wook direct?,SELECT COUNT(DISTINCT ?uri AS ?uri) WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Park_Chan-wook> . },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
23,How many airlines are there?,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Airline> },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
24,Which companies have more than 1 million employees?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/numberOfEmployees> ?n } UNION { ?uri <http://dbpedia.org/property/numEmployees> ?n } FILTER ( ?n > 1000000 ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
30,Which actors were born in Germany?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } },0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
31,Who produced the most films?,SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,0,0,1
32,How many missions does the Soyuz programme have?,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
34,Which writers studied in Istanbul?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> { ?uri <http://dbpedia.org/ontology/almaMater> ?x } UNION { ?uri <http://dbpedia.org/ontology/education> ?x } { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } },0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
36,Which countries adopted the Euro?,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Euro> } UNION { ?uri <http://dbpedia.org/property/currencyCode> ""EUR""@en } }",0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
37,Was Marc Chagall a jew?,"ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> <http://dbpedia.org/property/ethnicity> ""Jewish""@en }",0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
38,How many films did Leonardo DiCaprio star in?,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
39,Was Margaret Thatcher a chemist?,ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
40,Which U.S. states are in the same time zone as Utah?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Utah> <http://dbpedia.org/property/timezone> ?x . ?uri a <http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates> ; <http://dbpedia.org/property/timezone> ?x FILTER ( ?uri != <http://dbpedia.org/resource/Utah> ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
41,Which country has the most official languages?,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/officialLanguages> ?language . } ORDER BY DESC(COUNT(?language)) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,0,0,1
43,Which programming languages were influenced by Perl?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> { ?uri <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Perl> } UNION { <http://dbpedia.org/resource/Perl> <http://dbpedia.org/ontology/influenced> ?uri } },0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
44,What airlines are part of the SkyTeam alliance?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Airline> { ?uri <http://dbpedia.org/ontology/alliance> <http://dbpedia.org/resource/SkyTeam> } UNION { ?uri <http://dbpedia.org/ontology/Alliance> <http://dbpedia.org/resource/SkyTeam> } },0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
45,What is the highest mountain?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
46,Which poet wrote the most books?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Poet> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,0,0,1
47,Which musician wrote the most books?,SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Musician> . ?x <http://dbpedia.org/ontology/author> ?uri . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,0,0,1
48,How many airlines are members of the Star Alliance?,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Airline> ; <http://dbpedia.org/ontology/alliance> <http://dbpedia.org/resource/Star_Alliance> },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
50,For which label did Elvis record his first album?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x rdf:type dbo:Album ; dbo:artist res:Elvis_Presley ; dbo:releaseDate ?y ; dbo:recordLabel ?uri } ORDER BY ASC(?y) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
51,Is Christian Bale starring in Batman Begins?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Batman_Begins dbo:starring res:Christian_Bale },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
52,Which actor was casted in the most movies?,SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?f <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?f <http://dbpedia.org/ontology/starring> ?uri . } ORDER BY DESC(COUNT(DISTINCT(?f))) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,1,0,0,0,1
53,Which countries have more than two official languages?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> ; <http://dbpedia.org/ontology/officialLanguage> ?language } GROUP BY ?uri HAVING ( COUNT(?language) > 2 ),0,0,0,0,0,0,1,0,0,0,0,0,0,1,1,0,0,0
54,Which countries have more than ten caves?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> . ?cave a <http://dbpedia.org/ontology/Cave> { ?cave <http://dbpedia.org/ontology/location> ?uri } UNION { ?cave <http://dbpedia.org/ontology/location> ?loc . ?loc <http://dbpedia.org/ontology/country> ?uri } } GROUP BY ?uri HAVING ( COUNT(?cave) > 10 ),0,0,0,0,0,0,1,0,0,0,0,0,0,1,1,0,1,0
56,How many politicians graduated from Columbia University?,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Politician> ; <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Columbia_University> },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
57,Which telecommunications organizations are located in Belgium?,"SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Organisation> { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Telecommunication> } UNION { ?uri <http://dbpedia.org/property/industry> ?industry FILTER regex(?industry, ""Telecommunications"") } { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Belgium> } UNION { ?uri <http://dbpedia.org/property/locationCountry> ""Belgium""@en } }",0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0
58,Give me a list of all lakes in Denmark.,SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } },0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
59,What is the longest river?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/River> { ?uri <http://dbpedia.org/ontology/length> ?l } UNION { ?uri <http://dbpedia.org/property/length> ?l } } ORDER BY DESC(?l) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1
60,Which organizations were founded in 1930?,"SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Organisation> { ?uri <http://dbpedia.org/ontology/formationYear> ?date } UNION { ?uri <http://dbpedia.org/ontology/foundingYear> ?date } FILTER regex(?date, ""^1930"") }",0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
61,What is the smallest city by area in Germany?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX skos: <http://www.w3.org/2004/02/skos/core#> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX dct: <http://purl.org/dc/terms/> SELECT ?city WHERE { ?m skos:broader dbc:Cities_in_Germany . ?city dct:subject ?m ; dbo:areaTotal ?area } ORDER BY ?area LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
62,How heavy is Jupiter's lightest moon?,SELECT DISTINCT ?n WHERE { ?uri <http://dbpedia.org/property/satelliteOf> <http://dbpedia.org/resource/Jupiter> ; <http://dbpedia.org/ontology/mass> ?n } ORDER BY ASC(?n) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
64,What is the second highest mountain on Earth?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 1 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
65,Is Egypts largest city also its capital?,ASK WHERE { <http://dbpedia.org/resource/Egypt> <http://dbpedia.org/ontology/largestCity> ?large ; <http://dbpedia.org/ontology/capital> ?capital FILTER ( ?large = ?capital ) },0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
66,How many programming languages are there?,SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
67,Which Chess players died in the same place they were born in?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ChessPlayer> ; <http://dbpedia.org/ontology/birthPlace> ?x ; <http://dbpedia.org/ontology/deathPlace> ?y FILTER ( ?x = ?y ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
68,Give me all cities in New Jersey with more than 100000 inhabitants.,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:isPartOf res:New_Jersey ; dbo:populationTotal ?inhabitants FILTER ( ?inhabitants > 100000 ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
69,Which mountains are higher than the Nanga Parbat?,SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Nanga_Parbat> <http://dbpedia.org/ontology/elevation> ?elevation . ?uri a <http://dbpedia.org/ontology/Mountain> { ?uri <http://dbpedia.org/ontology/elevation> ?otherelevation } UNION { ?uri <http://dbpedia.org/property/elevationM> ?otherelevation } FILTER ( ?otherelevation > ?elevation ) },0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
70,Is Darth Vader Luke’s father?,ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Luke_Skywalker> },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
74,Who is the heaviest player of the Chicago Bulls?,SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/ontology/weight> ?num { ?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls> } UNION { ?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> } UNION { ?uri <http://dbpedia.org/ontology/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> } } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,1
75,What is the largest country in the world?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Country ; dbo:areaTotal ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
76,Is Cola a beverage?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Cola rdf:type dbo:Beverage },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
77,Was the Cuban Missile Crisis earlier than the Bay of Pigs Invasion?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Cuban_Missile_Crisis dbo:date ?x . res:Bay_of_Pigs_Invasion dbo:date ?y FILTER ( ?x < ?y ) },0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
78,What is the highest mountain in Saxony Germany?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?m WHERE { ?m dbo:mountainRange dbr:Ore_Mountains ; dbo:elevation ?height } ORDER BY DESC(?height) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
79,What is the biggest stadium in Spain?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Stadium ; dbo:location res:Spain ; dbo:seatingCapacity ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
80,Was Sigmund Freud married?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> ASK WHERE { dbr:Sigmund_Freud dbo:spouse ?uri },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
81,Are tree frogs a type of amphibian?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Hylidae dbo:class res:Amphibian },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
82,how much is the elevation of Düsseldorf Airport ?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?ele WHERE { dbr:Düsseldorf_Airport dbo:elevation ?ele } LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
83,Who was the first King of England?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Royalty ; rdf:type yago:WikicatEnglishMonarchs ; dbo:activeYearsStartYear ?date } ORDER BY ASC(?date) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
84,Who is the youngest Darts player?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:DartsPlayer ; dbo:birthDate ?date } ORDER BY DESC(?date) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
85,Is horse racing a sport?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { dbr:Horse_racing rdf:type dbo:Sport },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
86,Is the wife of president Obama called Michelle?,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Barack_Obama dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Michelle"") }",0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
87,Is Frank Herbert still alive?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { OPTIONAL { res:Frank_Herbert dbo:deathDate ?date } FILTER ( ! bound(?date) ) },0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
88,What is the last work of Dan Brown?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?book WHERE { { ?book dbo:author dbr:Dan_Brown . ?book dbp:releaseDate ?date } UNION { ?book dbo:author dbr:Dan_Brown . ?book dbo:publicationDate ?date} } ORDER BY DESC(xsd:date(?date)) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,1
89,When was the death  of  Shakespeare?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT ?x WHERE { dbr:William_Shakespeare dbo:deathDate ?x } LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
90,How often did Jane Fonda marry?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Jane_Fonda dbo:spouse ?uri },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
91,Was the wife of president Lincoln called Mary?,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK WHERE { res:Abraham_Lincoln dbo:spouse ?spouse . ?spouse rdfs:label ?name FILTER regex(?name, ""Mary"") }",0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
92,What is the longest river in the world?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri rdf:type dbo:BodyOfWater ; dbo:length ?length } ORDER BY DESC(?length) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
93,How many theories did Albert Einstein come up with?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT (COUNT(?uri) AS ?count) WHERE { dbr:Albert_Einstein dbo:knownFor ?uri },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
94,With how many countries Iran has borders?,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?border WHERE { dbr:Geography_of_Iran dbp:borders ?border } LIMIT 8,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
95,Did Arnold Schwarzenegger attend a university?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Arnold_Schwarzenegger dbo:almaMater ?x . ?x rdf:type dbo:University },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
96,Is James Bond married?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:James_Bond dbo:spouse ?uri },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
97,Does the Isar flow into a lake?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { ?x dbo:inflow res:Isar ; rdf:type dbo:Lake },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
98,Which Indian company has the most employees?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Company ; dbo:location res:India ; dbo:numberOfEmployees ?n } ORDER BY DESC(?n) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
99,Is Barack Obama a democrat?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Barack_Obama dbo:party <http://dbpedia.org/resource/Democratic_Party_(United_States)> },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
100,Which city has the most inhabitants?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:populationTotal ?pop } ORDER BY DESC(?pop) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
101,When will start the final match of the football world cup 2018?,PREFIX dbr: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT ?Date WHERE { dbr:2018_FIFA_World_Cup dbp:date ?Date } ORDER BY DESC(?Date) LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
102,What is the highest mountain in Italy?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Mountain ; dbo:locatedInArea res:Italy ; dbo:elevation ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
103,Who is the tallest basketball player?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:BasketballPlayer ; dbo:height ?num } ORDER BY DESC(?num) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
104,How many languages are spoken in Turkmenistan?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?x) AS ?c) WHERE { res:Turkmenistan dbo:language ?x },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
105,Did Che Guevara have children?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Che_Guevara dbo:child ?uri },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
106,Did Kaurismäki ever win the Grand Prix at Cannes?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Aki_Kaurismäki dbo:award <http://dbpedia.org/resource/Grand_Prix_(Cannes_Film_Festival)> },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
107,Who is the Formula 1 race driver with the most races?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:FormulaOneRacer ; dbo:races ?x } ORDER BY DESC(?x) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
108,Is Christian Bale starring in Velvet Goldmine?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Velvet_Goldmine dbo:starring res:Christian_Bale },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
109,How many ethnic groups live in Slovenia?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { res:Slovenia dbo:ethnicGroup ?uri },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
110,Was Natalie Portman born in the United States?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Natalie_Portman dbo:birthPlace ?city . ?city dbo:country res:United_States },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
111,Who is the oldest child of Meryl Streep?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Meryl_Streep dbo:child ?uri . ?uri dbo:birthDate ?d } ORDER BY ASC(?d) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
112,Was U.S. president Jackson involved in a war?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Andrew_Jackson dbo:battle ?battle },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
113,Did Tesla win a nobel prize in physics?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Nikola_Tesla dbo:award res:Nobel_Prize_in_Physics },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
114,How many states are in Mexico?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT (COUNT(?uri) AS ?count) WHERE { ?uri dbo:type dbr:States_of_Mexico },0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
115,Which city has the least inhabitants?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:City ; dbo:populationTotal ?pop } ORDER BY ASC(?pop) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
116,Does Neymar play for Real Madrid?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Neymar dbo:team <http://dbpedia.org/resource/Real_Madrid_C.F.> },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
117,Do Prince Harry and Prince William have the same parents?,"PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { <http://dbpedia.org/resource/Prince_William,_Duke_of_Cambridge> dbo:parent ?x . res:Prince_Harry dbo:parent ?x }",0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
118,Does Breaking Bad have more episodes than Game of Thrones?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Breaking_Bad dbo:numberOfEpisodes ?x . res:Game_of_Thrones dbo:numberOfEpisodes ?y FILTER ( ?y > ?x ) },0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
119,Which building after the Burj Khalifa has the most floors?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Burj_Khalifa dbo:floorCount ?burj . ?uri rdf:type dbo:Building ; dbo:floorCount ?proj FILTER ( ?proj < ?burj ) } ORDER BY DESC(?proj) LIMIT 1,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1
120,What was the final result of the War of the Roses?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX dbr: <http://dbpedia.org/resource/> SELECT DISTINCT ?result WHERE { ?uri dbo:isPartOfMilitaryConflict dbr:Wars_of_the_Roses ; dbo:result ?result ; dbo:date ?date } ORDER BY DESC(?date) OFFSET 0 LIMIT 1,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,1
121,Is proinsulin a protein?,PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> ASK WHERE { res:Proinsulin rdf:type dbo:Protein },0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
